# Вариант задания
Лабораторная работа № 1. 1. Ввести размер массива;
2.Сформировать массив с помощью операции new или
библиотечных функций malloc (calloc);
3.Заполнить массив (можно с помощью датчика случайных
чисел);
4.Выполнить задание варианта, сформировать новый
массив(ы)-результат(ы);
5.Напечатать массив(ы)-результат(ы);
6.Удалить динамические массивы с помощью операции
delete или библиотечной функции free.
Сформировать одномерный массив Удалить из него элемент
с заданным номером, добавить элемент с заданным
номером.
# Код программы
```cpp
#include<iostream>
#include <ctime>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	int n, k, l, s, m;
	srand(time(NULL));
	cout << "Колво элементов массива = ";
	cin >> n;
	int* arr = new int[n];
	
	cout << "k: ";
	cin >> k;
	for (int i = 0; i < n; i++)
	{
		arr[i] = rand();
		cout << arr[i] << " ";
	}
	cout << endl;
	int* mass = new int[n - k];
	for (int i = 0; i < k; i++)
	{
		mass[i] = arr[i];
	}
	for (int i = k-1; i < n-1 ; i++)
	{
		mass[i] = arr[i + k-1];
	}
	n--;
	for (int i = 0; i < n; i++)
	{
		cout << mass[i] << ' ';
	}
	delete[] arr;
	cout << endl;
	cout << "Введите номер, куда нужно вставить элемент: ";
	cin >> l;
	cout << "Введите значение элемента: ";
	cin >> s;
	int*  itog= new int[n - k + 1];
	for (int i = 0; i < l; i++)
	{
		itog[i] = mass[i];
	}
	itog[l] = s;
	for (int i = l + 1; i < n - k + 1; i++)
	{
		itog[i+1] = mass[i];
	}
	delete[] mass;
	for (int i = 0; i < n - k + 1; i++)
	{
		cout << itog[i] << " ";
	}
	delete[] itog;
	return 0;
}
```
# Блок-схема программы
<image src="lab_10.drawio.png">
	
# Тесты
### Пример 1
Входные данные:
```
Колво элементов массива = 6
k: 2
Введите номер, куда нужно вставить элемент: 4
Введите значение элемента: 5
```
Выходные данные:
```
17862 6973 22255 23685 6894 18083
17862 22255 23685 6894 18083
17862 22255 23685 6894 5 18083
```
### Пример 2
Входные данные:
```
Колво элементов массива = 8
k: 1
Введите номер, куда нужно вставить элемент: 3
Введите значение элемента: 0
```
Выходные данные:
```
20563 15777 17557 1102 17367 21457 6159 3847
15777 17557 1102 17367 21457 6159 3847
15777 17557 1102 0 17367 21457 6159 3847
```
### Пример 3
Входные данные:
```
Колво элементов массива = 3
k: 2
Введите номер, куда нужно вставить элемент: 3
Введите значение элемента: 10
```
Выходные данные:
```
20821 12933 19803
20821 19803
20821 19803 10
```
