# Вариант задания
Лабараторная работа №1.
Заполнить двумернный массив: если сумма номер (не индекс) строки и столбца, т.е. i + j, будет нечетна, то на место этого элемента ставится 0. Все другие элементы заполняются цифрами от 1 до 9 последовательно, пропуская те элементы, которые заняты нулями.
# Код программы
```cpp
#include <iostream>
using namespace std;
int main()
{
    int m, s = 1;
    const int n = 100;
    int a[n][n];
    cin >> m;
    cout << endl;
    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < m; j++)
        {
            if ((i + j) % 2 == 1)
            {
                a[i][j] = 0;
            }
            else
            {
                a[i][j] = s;
                s++;
                if (s == 10)
                {
                    s = 1;
                }
            }
            cout << a[i][j] << " ";
        }
        cout << endl;
    }
    return 0;
}
```
# Блок-схема программы
## Функция main
<image src="lab_1.drawio.png">

# Тесты
### Пример 1.
Входные данные:
`const int m = 5, n = 5;`
Выходные данные:
```
1 0 2 0 3
0 4 0 5 0
6 0 7 0 8
0 9 0 1 0
2 0 3 0 4
```
### Пример 2.
Входные данные:
`const int m = 12, n = 12;`
Выходные данные:
```
1 0 2 0 3 0 4 0 5 0 6 0 
0 7 0 8 0 9 0 1 0 2 0 3 
4 0 5 0 6 0 7 0 8 0 9 0 
0 1 0 2 0 3 0 4 0 5 0 6 
7 0 8 0 9 0 1 0 2 0 3 0 
0 4 0 5 0 6 0 7 0 8 0 9 
1 0 2 0 3 0 4 0 5 0 6 0 
0 7 0 8 0 9 0 1 0 2 0 3 
4 0 5 0 6 0 7 0 8 0 9 0 
0 1 0 2 0 3 0 4 0 5 0 6 
7 0 8 0 9 0 1 0 2 0 3 0 
0 4 0 5 0 6 0 7 0 8 0 9 
```
### Пример 3.
Входные данные:
`const int m = 10, n = 7;`
Выходные данные:
```
1 0 2 0 3 0 4 
0 5 0 6 0 7 0 
8 0 9 0 1 0 2 
0 3 0 4 0 5 0 
6 0 7 0 8 0 9 
0 1 0 2 0 3 0 
4 0 5 0 6 0 7 
0 8 0 9 0 1 0 
2 0 3 0 4 0 5 
0 6 0 7 0 8 0 
```
