# Вариант задания
Лабараторная работа №2.
Заполнить двумернный массив: если сумма номер (не индекс) строки и столбца, т.е. i + j, будет нечетна, то на место этого элемента ставится 0. Все другие элементы заполняются цифрами от 1 до 9 последовательно, пропуская те элементы, которые заняты нулями.
# Код программы
```cpp
#include <iostream>
using namespace std;
int main()
{
	const int m = 100;
	int numbers, n;
	int a[m][m] = { 0 };
	cin >> n;
	cout << endl;
	for (int i = 0; i < n; i++)
	{
		numbers = 1;
		for (int j = n - 1; j >= 0; j--)
		{
			if (j <= i)
			{
				a[i][j] = numbers;
				numbers++;
				if (numbers == 10) numbers = 1;
			}
		}
	}
	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << a[i][j] << " ";
		}
		cout << endl;
	}
	return 0;
}
```
# Блок-схема программы
## Функция main
<image src="lab_2.drawio.png">

# Тесты
### Пример 1.

Входные данные:

`const int n = 5;`

Выходные данные:

```
1 0 0 0 0 
2 1 0 0 0 
3 2 1 0 0 
4 3 2 1 0 
5 4 3 2 1 
```

### Пример 2.

Входные данные:

`const int n = 7;`

Выходные данные:

```
1 0 0 0 0 0 0 
2 1 0 0 0 0 0 
3 2 1 0 0 0 0 
4 3 2 1 0 0 0 
5 4 3 2 1 0 0 
6 5 4 3 2 1 0 
7 6 5 4 3 2 1 
```

### Пример 3.

Входные данные:

`const int n = 15;`

Выходные данные:

```
1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 
2 1 0 0 0 0 0 0 0 0 0 0 0 0 0 
3 2 1 0 0 0 0 0 0 0 0 0 0 0 0 
4 3 2 1 0 0 0 0 0 0 0 0 0 0 0 
5 4 3 2 1 0 0 0 0 0 0 0 0 0 0 
6 5 4 3 2 1 0 0 0 0 0 0 0 0 0 
7 6 5 4 3 2 1 0 0 0 0 0 0 0 0 
8 7 6 5 4 3 2 1 0 0 0 0 0 0 0 
9 8 7 6 5 4 3 2 1 0 0 0 0 0 0 
1 9 8 7 6 5 4 3 2 1 0 0 0 0 0 
2 1 9 8 7 6 5 4 3 2 1 0 0 0 0 
3 2 1 9 8 7 6 5 4 3 2 1 0 0 0 
4 3 2 1 9 8 7 6 5 4 3 2 1 0 0 
5 4 3 2 1 9 8 7 6 5 4 3 2 1 0 
6 5 4 3 2 1 9 8 7 6 5 4 3 2 1 
```
