# Вариант задания
Лабораторная работа по классам №1, вариант 11. 
Поле first дробное положительное число, оклад, поле second - целое положительное число, количество отработанных дней. Реализовать метод summa() - вычисление начисленной суммы за данное количество дней по формуле: оклад/количество_дней_месяца* количество_отработанных_дней.
# Код программы
```cpp
﻿#include <iostream>
#include "fraction.h"
using namespace std;

fraction make_fraction(double F, int S, int D)
{
    fraction t;
    t.Init(F, S, D);
    return t;
}
void fraction::Init(double F, int S, int D)
{
    first = F;
    second = S;
    date = D;
}
void fraction::Read()
{
    cout << "first = ";
    cin >> first;
    cout << "second = ";
    cin >> second;
    cout << "date = ";
    cin >> date;
}

void fraction::Show()
{
    cout << "first = " << first << endl;
    cout << "second = " << second << endl;
    cout << "date = " << date << endl;
}

double fraction::Summa()
{
    return first / second * date;
}
int main()
{
    setlocale(LC_ALL, "Russian");
    fraction A;
    A.Read();
    A.Show();

    if (A.date > 31 || A.date <= 0 || A.second > 31 || A.second <= 0)
    {
        cout << "Неподходящее значение";
    }
    else
    {
        cout << "A.Summa = " << A.Summa() << endl;
    }
    return 0;

```
# Блок-схема программы
<image src="class1.png">
	
# Тесты
### Пример 1
Входные данные:
```
first = 35000.0
second = 20
date = 30
```
Выходные данные:
```
first = 35000
second = 20
date = 30
A.Summa = 52500
```
### Пример 2
Входные данные:
```
first = 45000.500
second = 25
date = 31
```
Выходные данные:
```
first = 45000.5
second = 25
date = 31
A.Summa = 55800.6
```
### Пример 3
Входные данные:
```
first = 40000
second = 30
date = 32
```
Выходные данные:
```
first = 40000
second = 30
date = 32
Неподходящее значение
```
# Контрольные вопросы
1.	Что такое класс?
Класс - абстрактный тип данных, который создает пользователь, состоящий из данных и функций. Позволяет представить часть кода в виде одного объекта. В объектно-ориентированном программировании программа представляется в виде множества объектов, что позволяет регулировать отношения между ними.
Пример класса Point:
class Point {
int x, y;
public:
	int GetX() { return x; }
};
2.	Что такое объект (экземпляр) класса?
Объект (экземпляр) - отдельный переменная класса, которая характеризуется данными его полей. 
Пример объекта:
Point A;
3.	Как называются поля класса?
Атрибуты, в примере из вопроса (1) это поля x, y

4.	Как называются функции класса?
Методы, в примере из вопроса (1) это функция GetX()
5.	Для чего используются спецификаторы доступа?
Спецификаторы используются для регулирования области видимости и времени жизни переменной. Действие любого спецификатора распространяется до следующего спецификатора или до конца класса.

6.	Для чего используется спецификатор public?
Спецификатор public задаёт последующим переменным глобальную область видимости (доступны в коде вне класса) и время жизни до конца выполнения программы.
7.	Для чего используется спецификатор private?
Спецификатор private задаёт последующим переменным локальную область видимости (доступны только в классе) и время жизни - во время компиляции кода описания класса.
8.	Если описание класса начинается со спецификатора class, то какой спецификатор доступа будет использоваться по умолчанию?
Для типа данных class по умолчанию действует спецификатор private.
9.	Если описание класса начинается со спецификатора struct, то какой спецификатор доступа будет использоваться по умолчанию?
Для типа данных struct по умолчанию действует спецификатор public.
10.	 Какой спецификатор доступа должен использоваться при описании интерфейса класса? Почему?
Для описания класса должен использоваться спецификатор public для того, чтобы его поля/методы были доступны для использования в других частях кода, и класс не был изолированной структурой данных.
11.	 Каким образом можно изменить значение атрибутов экземпляра класса?
Если атрибуты имеют public доступ, то изменить поля можно, обратившись по имени, по указателю или по ссылке.
class Point {
public:
int x, y;
};
int main() {
Point a; //доступ по имени
a.x = 20;
Point* b = new Point; //доступ по указателю
b->x = 19;
Point& c = a; //доступ по ссылке
c.x = 18;
return 0;
}
Если атрибуты имеют private доступ, то изменить поля можно, обратившись к public методам-модификаторам. 
class Point{
	int x;
public:
	void SetX(int n) { x= n; }
};
int main() {
	Point a;
	//a.x = 5; невозможно из-за private доступа поля
	a.SetX(5);
	return 0;
}
12.	 Каким образом можно получить значения атрибутов экземпляра класса?
Если атрибуты имеют public доступ, то получить доступ к полям можно, обратившись по имени, по указателю или по ссылке.
class Point {
public:
int x;
};
int main() {
Point a;
cout << a.x; //доступ по имени
Point* b = new Point;
cout << b->x; //доступ по указателю
Point& c = a;
cout << c.x; //доступ по ссылке
return 0;
}
Если атрибуты имеют private доступ, то получить доступ к полям можно, обратившись к public методам-модификаторам. 
class Point{
	int x;
public:
int GetX() { return x; }
};
int main() {
	Student a;
	//cout << a.x; невозможно из-за private доступа поля
	cout << a.GetX();
	return 0;
}

13.	 Класс определен следующим образом
struct Student {
string name;
int group;
}; 
Объект класса определен следующим образом 
Student *s = new Student; 
Как можно обратиться к полю name объекта s?

Так как у типа данных struct по умолчанию public доступ, то к полям можно обратиться непосредственно. Так как экземпляр класса задан через указатель, то к нему можно обратиться s->name, что равносильно записи (*s).name.
14.	 Класс определен следующим образом
struct Student {
string name;
int group;
}; 
Объект класса определен следующим образом 
Student s; 
Как можно обратиться к полю name объекта s?

Так как у типа данных struct по умолчанию public доступ, то к полям можно обратиться непосредственно. Так как экземпляр класса задан по имени, то к нему можно обратиться s.name.
15.	 Класс описан следующим образом
class Student {
	string name;
	int group;
};
Объект класса определен следующим образом 
Student *s = new Student; 
Как можно обратиться к полю name объекта s?

Так как у типа данных class по умолчанию private доступ, то к полям нельзя обратиться непосредственно, и требуются специальные методы с public доступом, которые называются геттеры или селекторы. 
16.	 Класс описан следующим образом
class Student {
	string name;
	int group;
public:
…
};
Объект класса определен следующим образом 
Student s;
Как можно обратиться к полю name объекта s?

Так как у типа данных class по умолчанию private доступ, то к полям нельзя обратиться непосредственно, и требуются специальные методы с public доступом, которые называются геттеры или селекторы. Допустим, в public секции определен некоторый метод 
void GetName() { return name; }
Тогда к полю можно обратиться следующим образом
s.GetName();

17.	 Класс описан следующим образом
class Student {
public:
char* name;
int group;
};
Объект класса определен следующим образом
Student *s = new Student;
Как можно обратиться к полю name объекта s?

Так как у данного класса указан public доступ, то к полям можно обратиться непосредственно. Так как экземпляр объявлен через указатель, то обратиться к нему можно s->name или (*s).name.
