# Вариант задания
Лабораторная работа по классам №1, вариант 11. 
Поле first дробное положительное число, оклад, поле second - целое положительное число, количество отработанных дней. Реализовать метод summa() - вычисление начисленной суммы за данное количество дней по формуле: оклад/количество_дней_месяца* количество_отработанных_дней.
# Код программы
```cpp
﻿#include <iostream>
#include "fraction.h"
using namespace std;

fraction make_fraction(double F, int S, int D)
{
    fraction t;
    t.Init(F, S, D);
    return t;
}
void fraction::Init(double F, int S, int D)
{
    first = F;
    second = S;
    date = D;
}
void fraction::Read()
{
    cout << "first = ";
    cin >> first;
    cout << "second = ";
    cin >> second;
    cout << "date = ";
    cin >> date;
}

void fraction::Show()
{
    cout << "first = " << first << endl;
    cout << "second = " << second << endl;
    cout << "date = " << date << endl;
}

double fraction::Summa()
{
    return first / second * date;
}
int main()
{
    setlocale(LC_ALL, "Russian");
    fraction A;
    A.Read();
    A.Show();

    if (A.date > 31 || A.date <= 0 || A.second > 31 || A.second <= 0)
    {
        cout << "Неподходящее значение";
    }
    else
    {
        cout << "A.Summa = " << A.Summa() << endl;
    }
    return 0;

```
# Блок-схема программы
<image src="class1.png">
	
# Тесты
### Пример 1
Входные данные:
```
Колво элементов массива = 6
k: 2
Введите номер, куда нужно вставить элемент: 4
Введите значение элемента: 5
```
Выходные данные:
```
17862 6973 22255 23685 6894 18083
17862 22255 23685 6894 18083
17862 22255 23685 6894 5 18083
```
### Пример 2
Входные данные:
```
Колво элементов массива = 8
k: 1
Введите номер, куда нужно вставить элемент: 3
Введите значение элемента: 0
```
Выходные данные:
```
20563 15777 17557 1102 17367 21457 6159 3847
15777 17557 1102 17367 21457 6159 3847
15777 17557 1102 0 17367 21457 6159 3847
```
### Пример 3
Входные данные:
```
Колво элементов массива = 3
k: 2
Введите номер, куда нужно вставить элемент: 3
Введите значение элемента: 10
```
Выходные данные:
```
20821 12933 19803
20821 19803
20821 19803 10
```
