# Вариант задания
Лабараторная работа №4, вариант 1.
1) Сформировать одномерный массив целых чисел,
используя датчик случайных чисел.
2) Распечатать полученный массив.
23
Значение Значение
объекта
Указатель а
&a *а –объект,
адресуемый
указателем а
3) Удалить элемент с номером К.
4) Добавить после каждого четного элемента массива
элемент со значением 0.
5) Распечатать полученный массив.
# Код программы
```cpp
#include <iostream>
#include <ctime>
using namespace std;
int main()
{
	int k, n;
	int arr[100] = {};
	srand(time(NULL));
	cout << "n ";
	cin >> n;
	cout << " k ";
	cin >> k;
	for (int i = 0; i < n; i++)
	{
		arr[i] = rand();
		cout << arr[i] << " ";
		
	}
	cout << endl;

	for (int j = k - 1; j < n - 1; j++)
	{
		arr[j] = arr[j+1];
	}
	n--;
	for (int i = n-1; i >0; i--)
	{
		if (i % 2 != 0) {
			for (int j = n-1; j > i; j--)
			{
				arr[j+1] = arr[j];
			}
			arr[i+1] = 0;
			i--;
			n++;
		}
	}
	for (int i = 0; i < n; i++)
	{
		cout << arr[i] << " ";
	}
	return 0;
}
```
# Блок-схема программы
<image src="lab_4.drawio.png">
	
# Тесты
### Пример 1
Входные данные:
```
n=6
k=3
```
Выходные данные:
```
29753 21695 11370 9320 16223 9685
29753 21695 0 9320 16223 0 9685
```
### Пример 2
Входные данные:
```
n=4
k=2
```
Выходные данные:
```
30220 18621 10042 9734
30220 10042 0 9734
```
### Пример 3
Входные данные:
```
n=7
k=1
```
Выходные данные:
```
30364 31 9634 19944 11736 23087 11620
31 9634 0 19944 11736 0 23087 11620 0
```
