# Вариант задания
Лабараторная работа №7.2, вариант 1.
Написать функцию sum с переменным числом параметров,
которая находит сумму чисел типа int. Написать
вызывающую функцию main, которая обращается к функции
sum не менее трех раз с количеством параметров 3, 7,
11.
# Код программы
```cpp
#include <iostream>
using namespace std;
int func(int k, ...) 
{
    int s = 0;
    int* p = &k;
    for (; k >= 1; k--) 
    {
        s += *(++++p);
    }
    return s;
}

int main()
{
    cout << func(3, 1, 7, 9) << endl;
    cout << func(7, 1, 3, 4, 1, 7, 8, 8) << endl;
    cout << func(11, 1, 0, 2, 3, 4, 5, 6, 7, 8, 1, 0) << endl;
    return 0;
}
```
# Блок-схема программы
<image src="lab_4.drawio.png">
	
# Тесты
### Пример 
Входные данные:
```
3, 1, 7, 9
7, 1, 3, 4, 1, 7, 8, 8
11, 1, 0, 2, 3, 4, 5, 6, 7, 8, 1, 0
```
Выходные данные:
```
17
32
37
```
